clc;
%%%%HFSS中拟合所需得离散点
 
%%%BJ-100波导，工作在10GHz 
%%%原始离散点数据
%angle_dis=[0.4 0.6 0.8 1 1.5 2 2.5 3 4 4.5 5 7 10 15 20 25];
%g_dis=[0.00126722 0.00129028 0.0014286 0.0014056 0.00163617 0.00186683 0.00265148 0.0023744 0.0036678 0.00431511 0.0049397 0.0084399 0.016178 0.035929 0.06657 0.105529];
%L_dis=[2.55 2.6 2.83 2.67 2.56 2.76 2.62 2.5 2.695 2.61 2.77 2.69 2.6 2.59 2.33 2.15];
 
%%%%BJ-100波导，工作在9GHz
%%%原始离散点数据
%angle_dis=[0.6 0.8 1 1.5 2 2.5 3 3.5 4 4.5 5 7 10 15 20 25]; 
%g_dis=[0.0013133 0.00138251 0.001474741 0.001843766 0.002143699 0.002628395 0.003113326 0.00385272 0.00461579 0.005425741 0.00623635 0.0108344 0.021057 0.049204 0.09323 0.1456184];
%L_dis=[3.26 3.29 3.32 3.24 3.16 3.42 3.4 3.3 3.34 3.37 3.4 3.4 3.3 3.3 3.2 3];
 
%%%BJ-58波导，工作在6GHz
%%%%原始离散点数据
angle_dis=[1 1.5 2 3 4 5 7 10 12 15 20 25];             
g_dis=[0.0011213 0.00131334 0.00154392 0.002397558 0.0034136392 0.005240552 0.008323758 0.01603381 0.0224922 0.0344988 0.06238 0.1006266];
L_dis=[2.15 2.24 2.16 2.17 2.16 2.15 2.2 2 1.96 1.96 1.6 1.2];
 
%%%%BJ-58波导，工作在5GHz
%%%%%原始离散点数据
%angle_dis=[0.2 0.4 0.6 0.8 1 1.5 2 2.5 3 3.5 4 4.5 5 7 10 15 20  25]; 
%g_dis=[0.001313335 0.00138251 0.00147471 0.00145168 0.00177456 0.00177456 0.0021899 0.00267457 0.00332123 0.00403765 0.00500911 0.0060278 0.0070244 0.012395 0.025109 0.056574 0.1057 0.17557];
%L_dis=[4.7 4.3 4.55 4.4 4.55 4.5 5 4.1 4.93 4.96 4.74 4.75 4.57 4.6 4 4.3 3.9 3.4];
 
%%%%曲线拟合多项式前面系数
p1=polyfit(angle_dis,g_dis,2);   %对“倾斜角度-谐振电导”进行最小二乘法拟合，并返回系数
%p2=polyfit(angle_dis,L_dis,3);  %%%quit commend
 
%%%%拟合时选定的自变量和因变量范围
angle=0:0.1:30;
g=polyval(p1,angle);                %%%%得到的拟合函数
%L=polyval(p2,angle);               %%quit commend
 
%%%画“倾斜角度--谐振电导”曲线拟合图
subplot(2,1,1);
plot(angle_dis,g_dis,'*',angle,g);%在一个坐标系中绘拟合函数以及离散点
grid on;
title('f(angle,g)');
xlabel('angle(degrees)');
ylabel('g(normalize conductance)');
legend('采样数据','拟合曲线');
 
%%%画“倾斜角度--谐振长度”曲线拟合图
subplot(2,1,2);                                                                        %%%使用样条插值拟合“倾斜角度-谐振深度”曲线
values=spcrv([[angle_dis(1) angle_dis angle_dis(end)];[L_dis(1) L_dis L_dis(end)]],3);  %%%在同一坐标系绘离散点以及拟合曲线   
   
plot(angle_dis,L_dis,'*',values(1,:),values(2,:),'r','LineWidth',1);                                  
grid on;
title('f(angle,L)');
xlabel('angle(degrees)');
ylabel('L(mm)');
legend('采样数据','拟合曲线');
